In [1]:
import pandas as pd
import numpy as np

层次化索引
能在一个轴上拥有多个索引级别
能以低纬度形式处理高维度的数据

In [2]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])
data

a  1    0.439280
   2   -1.052984
   3   -0.648683
b  1   -1.638338
   3    0.631244
c  1    0.592670
   2    1.774514
d  2    0.758011
   3   -0.308753
dtype: float64

DataFrame.index得到美化后的标签

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

可以使用部分索引直接选取数据子集

In [6]:
data['b']

1   -1.638338
3    0.631244
dtype: float64

In [7]:
data['b':'d']

b  1   -1.638338
   3    0.631244
c  1    0.592670
   2    1.774514
d  2    0.758011
   3   -0.308753
dtype: float64

In [8]:
data.loc[['b','d']]

b  1   -1.638338
   3    0.631244
d  2    0.758011
   3   -0.308753
dtype: float64

还能直接选取内层

In [9]:
data.loc[:,2]

a   -1.052984
c    1.774514
d    0.758011
dtype: float64

透视表

In [10]:
data.unstack()

          1         2         3
a  0.439280 -1.052984 -0.648683
b -1.638338       NaN  0.631244
c  0.592670  1.774514       NaN
d       NaN  0.758011 -0.308753

unstack()的逆运算为stack()

In [12]:
data.unstack().stack()

a  1    0.439280
   2   -1.052984
   3   -0.648683
b  1   -1.638338
   3    0.631244
c  1    0.592670
   2    1.774514
d  2    0.758011
   3   -0.308753
dtype: float64

In [13]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],['1','2','3','4']],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 3     6   7        8
  4     9  10       11

In [14]:
frame.index.names=['key1','key2']
frame.columns.names=['State','Color']
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    3        6   7        8
     4        9  10       11

重排与分级排序

In [15]:
frame.swaplevel('key1','key2')

State      Ohio     Colorado
Color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
3    b        6   7        8
4    b        9  10       11

sort_index用来对指定级别索引排序

In [16]:
frame.sort_index(level=1)

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    3        6   7        8
     4        9  10       11

In [17]:
frame.swaplevel(0,1).sort_index(level=0)

State      Ohio     Colorado
Color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
3    b        6   7        8
4    b        9  10       11

sum中使用level指定级别分别统计

In [20]:
frame.sum(level='key1')

State  Ohio     Colorado
Color Green Red    Green
key1
a         3   5        7
b        15  17       19

合并数据集
pandas.merge可根据一个或多个键将不同DataFrame中的行连接起来。SQL或其他关系型数据库的用户对此应该会比较熟悉，因为它实现的就是数据库的join操作。
pandas.concat 可以沿着一条轴将多个对象堆叠到一起。
实例方法combine_first可以将重复数据编接在一起，用一个对象中的值填充另一个对象中的缺失值。

In [22]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [23]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [24]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

没有指定连接的列，会默认使用重叠的列名

In [25]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

轴向连接
np有concatenate进行连接

In [26]:
arr=np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [27]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [28]:
s1=pd.Series([0,1],index=['a','b'])
s2=pd.Series([2,3,4],index=['c','d','e'])
s3=pd.Series([5,6],index=['f','g'])

In [29]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

join='inner'可以看到交集

合并重叠数据

长格式旋转为宽格式

In [2]:
data=pd.read_csv('macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [3]:
periods=pd.PeriodIndex(year=data.year,quarter=data.quarter,name='date')

In [4]:
columns=pd.Index(['realgdp','infl','unemp'],name='item')

In [5]:
data=data.reindex(columns=columns)
data.index=periods.to_timestamp('D','end')

In [6]:
ldata=data.stack().reset_index().rename(columns={0:'value'})

In [8]:
data.head()

item         realgdp  infl  unemp
date
1959-03-31  2710.349  0.00    5.8
1959-06-30  2778.801  2.34    5.1
1959-09-30  2775.488  2.74    5.3
1959-12-31  2785.204  0.27    5.6
1960-03-31  2847.699  2.31    5.2

In [10]:
ldata.head()

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340

宽格式旋转为长格式
用pd.melt指定唯一分组指标

In [12]:
df=pd.DataFrame({'key':['foo','bar','baz'],
                'A':[1,2,3],
                'B':[4,5,6],
                'C':[7,8,9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [14]:
melted=pd.melt(df,['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [18]:
melted=pd.melt(df,['A'])
melted

   A variable value
0  1      key   foo
1  2      key   bar
2  3      key   baz
3  1        B     4
4  2        B     5
5  3        B     6
6  1        C     7
7  2        C     8
8  3        C     9

使用pivot可以重塑回原来的样子

In [21]:
reshaped=melted.pivot('A','variable','value')
reshaped

variable  B  C  key
A
1         4  7  foo
2         5  8  bar
3         6  9  baz